src/ex_Tabakon/InformationRegisters/СоответствияОбъектовИнформационныхБаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СоответствияОбъектовИнформационныхБаз</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УникальныйИдентификаторПриемника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УникальныйИдентификаторИсточника</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипПриемника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ex_Tabakon/InformationRegisters/СоответствияОбъектовИнформационныхБаз/Ext/ManagerModule.bsl
Функция ЧисткаДублейХарактеристик() ЭКСПОРТ
	Запрос	=	Новый запрос("ВЫБРАТЬ
	      	 	             |	СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторИсточника КАК УникальныйИдентификаторИсточника,
	      	 	             |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторПриемника) КАК УникальныйИдентификаторПриемника
	      	 	             |ПОМЕСТИТЬ Итог
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.СоответствияОбъектовИнформационныхБаз КАК СоответствияОбъектовИнформационныхБаз
	      	 	             |ГДЕ
	      	 	             |	СоответствияОбъектовИнформационныхБаз.ТипИсточника = &ТипИсточника
	      	 	             |
	      	 	             |СГРУППИРОВАТЬ ПО
	      	 	             |	СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторИсточника
	      	 	             |;
	      	 	             |
	      	 	             |////////////////////////////////////////////////////////////////////////////////
	      	 	             |ВЫБРАТЬ
	      	 	             |	Итог.УникальныйИдентификаторИсточника КАК УникальныйИдентификаторИсточника
	      	 	             |ИЗ
	      	 	             |	Итог КАК Итог
	      	 	             |ГДЕ
	      	 	             |	Итог.УникальныйИдентификаторПриемника > 1");
	Запрос.УстановитьПараметр("ТипИсточника","СправочникСсылка.ХарактеристикиНоменклатуры");
	Рез = Запрос.Выполнить().Выгрузить();
	Для каждого Строка из Рез цикл
		НЗ = РегистрыСведений.СоответствияОбъектовИнформационныхБаз.СоздатьНаборЗаписей();
		НЗ.Отбор.УникальныйИдентификаторИсточника.Установить(Строка.УникальныйИдентификаторИсточника);
		Попытка
			НЗ.Записать();
		Исключение
		КонецПопытки;
		
	КонецЦикла; 	
КонецФункции
